---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
source: html/523c00d8-a543-b963-7ec5-6bf7b8da60f5.htm
---
# StructuralSectionGeneralS Methods

Returns size of the section boundary.